<?php

###############################################################################
# ukrainian.php
# This is the Ukrainian language page for GeekLog!
# Special thanks to Mischa Polivanov for his work on this project
#
# Copyright (C) 2005 Yaroslav Fedevych
# jaroslaw@nospam.kiev.ua
# 
#
# This program is free software; you can redistribute it and/or
# modify it under the terms of the GNU General Public License
# as published by the Free Software Foundation; either version 2
# of the License, or (at your option) any later version.
#
# This program is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
# GNU General Public License for more details.
#
# You should have received a copy of the GNU General Public License
# along with this program; if not, write to the Free Software
# Foundation, Inc., 59 Temple Place - Suite 330, Boston, MA  02111-1307, USA.
#
###############################################################################

$LANG_CHARSET = 'utf-8';

###############################################################################
# Array Format:
# $LANGXX[YY]:  $LANG - variable name
#               XX    - file id number
#               YY    - phrase id number
###############################################################################

###############################################################################
# USER PHRASES - These are file phrases used in end user scripts
###############################################################################

###############################################################################
# lib-common.php

$LANG01 = array(
    1 => 'Надіслано:',
    2 => 'читати далі',
    3 => 'дописів',
    4 => 'Редаґувати',
    5 => 'Голосувати',
    6 => 'Результати',
    7 => 'Підсумки опитування',
    8 => 'голосів',
    9 => 'Адміністраторські функції:',
    10 => 'Надіслане',
    11 => 'Статті', 
    12 => 'Блоки',
    13 => 'Теми',
    14 => 'Посилання',
    15 => 'Події',
    16 => 'Опитування',
    17 => 'Користувачі',
    18 => 'Запит SQL',
    19 => 'Вийти',
    20 => 'Інформація про користувача:',
    21 => 'Реєстраційне ім\'я',
    22 => 'Ідентифікатор користувача',
    23 => 'Рівень безпеки',
    24 => 'Анонім',
    25 => 'Відповідь',
    26 => 'Власниками нижчеподаних коментарів є їхні дописувачі. Власники сайту не відповідають за їхній зміст.',
    27 => 'Найсвіжіший допис',
    28 => 'Видалити',
    29 => 'Нема користувацьких коментарів.',
    30 => 'Давніші статті', // stories
    31 => 'Дозволені мітки HTML:',
    32 => 'Помилка, недопустиме реєстраційне ім\'я',
    33 => 'Помилка, не вдалося здійснити запис до протокольного файлу',
    34 => 'Помилка',
    35 => 'Відреєструватись',
    36 => 'на',
    37 => 'Нема користувацьких статей', // stories
    38 => 'Трансляція вмісту', // syndication
    39 => 'Поновити',
    40 => 'У вашому <tt>php.ini</tt> встановлено <tt>register_globals = Off</tt>. Geeklog, однак, потребує, щоб значенням <tt>register_globals</tt> було <strong>on</strong>. Перш ніж продовжити, будь ласка, встановіть його в <strong>on</strong> та перезапустіть веб-сервер.',
    41 => 'Користувачі-гості',
    42 => 'Написав:', 
    43 => 'Відповісти на це',
    44 => 'Предок',
    45 => 'Номер помилки MySQL',
    46 => 'Повідомлення MySQL про помилку',
    47 => 'Функції користувача',
    48 => 'Профіль користувача',
    49 => 'Вподобання',
    50 => 'Помилка у виразі SQL',
    51 => 'довідка',
    52 => 'Створити', 
    53 => 'Адміністраторська домівка',
    54 => 'Не вдалося відкрити файл.',
    55 => 'Помилка при',
    56 => 'Голосувати', // vote
    57 => 'Пароль',
    58 => 'Увійти', // login
    59 => "Ще не зареєструвались? Зареєструйтесь як <a href=\"{$_CONF['site_url']}/users.php?mode=new\">новий користувач</a>",
    60 => 'Розмістити коментар',
    61 => 'Створити новий профіль',
    62 => 'слів',
    63 => 'Вподобання щодо коментарів',
    64 => 'Надіслати статтю другові електронною поштою',
    65 => 'Варіант для друку', // view print version
    66 => 'Мій календар',
    67 => 'Ласкаво просимо до ',
    68 => 'Домівка',
    69 => 'Зв\'язок',
    70 => 'Пошук',
    71 => 'Зробити внесок',
    72 => 'Ресурси Тенет',
    73 => 'Попередні опитування',
    74 => 'Календар',
    75 => 'Складний пошук', // advanced
    76 => 'Статистика сайту',
    77 => 'Втулки', 
    78 => 'Найближчі події', // upcoming
    79 => 'Що нового',
    80 => 'повідомлень за останні',
    81 => 'повідомлення за останні',
    82 => 'годин',
    83 => 'КОМЕНТАРІ',
    84 => 'ПОСИЛАННЯ',
    85 => 'за останні 48 год',
    86 => 'Нема нових коментарів',
    87 => 'за останні 2 тижні',
    88 => 'Нема недавніх нових посилань',
    89 => 'Наближчим часом немає жодних подій',
    90 => 'Домівка',
    91 => 'Цю сторінку створено за',
    92 => 'секунд',
    93 => 'Copyright',
    94 => 'Всі торгові марки й авторські права на цій сторінці належать їх відповідним власникам.',
    95 => 'Тут використано',
    96 => 'Групи',
    97 => 'Перелік слів',
    98 => 'Втулки',
    99 => 'СТАТТІ',
    100 => 'Нема нових статей',
    101 => 'Ваші події',
    102 => 'Події на сайті',
    103 => 'Резервні копії БД',
    104 => '', // by
    105 => 'Листувати користувачам',
    106 => 'Перегляди',
    107 => 'Тест версії GL',
    108 => 'Очистити кеш',
    109 => 'Повідомити про зловживання',
    110 => 'Повідомити адміністратора про цей допис',
    111 => 'Перегляд PDF-варіанту',
    112 => 'Зареєстровані користувачі',
    113 => 'Документація'
);

###############################################################################
# calendar.php

$LANG02 = array(
    1 => 'Календар подій',
    2 => 'Пробачте, однак показати нічого.',
    3 => 'Коли',
    4 => 'Де',
    5 => 'Опис',
    6 => 'Додати подію', // END
    7 => 'Найближчі події',
    8 => 'Додавши цю подію до свого календаря, ви можете швидко оглянути лише цікаві для вас події, клацнувши "Мій календар" з зони функцій користувача.',
    9 => 'Додати до мого календаря',
    10 => 'Вилучити з мого календаря',
    11 => "Додавання події до календаря користувача {$_USER['username']}",
    12 => 'Подія',
    13 => 'Розпочинається',
    14 => 'Завершується',
    15 => 'Повернутись до календаря'
);

###############################################################################
# comment.php

$LANG03 = array(
    1 => 'Розмістити коментар',
    2 => 'Режим допису',
    3 => 'Відреєструватись',
    4 => 'Зареєструватись',
    5 => 'Реєстраційне ім\'я',
    6 => 'На цьому сайті вимагається ваша реєстрація для розміщення коментарів.  Якщо у вас немає профілю, ви можете скористатись поданою нижче формою для його створення.',
    7 => 'Ваш останній коментар зроблено ',
    8 => " секунд тому.  На цьому сайті вимагається {$_CONF['commentspeedlimit']} секунд(и) між коментарями",
    9 => 'Коментар', // Comment
    10 => 'Надіслати звіт',
    11 => 'Надіслати коментар',
    12 => 'Будьте ласкаві заповнити поля &laquo;Назва&raquo; й &laquo;Коментар&raquo; &mdash; вони необхідні для надіслання вашого коментаря.',
    13 => 'Ваша інформація',
    14 => 'Попередній перегляд',
    15 => 'Повідомити про цей допис',
    16 => 'Назва',
    17 => 'Помилка',
    18 => 'Важлива інформація',
    19 => 'Будь ласка, дотримуйтесь теми обговорення.',
    20 => 'Намагайтесь відповідати на коментарі інших замість створювати нові нитки.',
    21 => 'Читайте дописи інших перед розміщенням власних задля уникнення повторень того, що вже було сказано.',
    22 => 'Використайте ясну тему, котра опише, про що йдеться у вашому повідомленні.',
    23 => 'Ваша адреса електронної пошти НЕ публікуватиметься.',
    24 => 'Анонімний користувач',
    25 => 'Ви впевнені, що бажаєте повідомити про цей допис адміністраторові?',
    26 => '%s повідомляє про надуживання в дописі наступного змісту:',
    27 => 'Звіт про надуживання'
);

###############################################################################
# users.php

$LANG04 = array(
    1 => 'Користувацький профіль для',
    2 => 'Реєстраційне ім\'я',
    3 => 'Повне ім\'я',
    4 => 'Пароль',
    5 => 'Електронна пошта',
    6 => 'Домівка',
    7 => 'Біографія',
    8 => 'Ключ PGP',
    9 => 'Зберегти інформацію',
    10 => 'Останні 10 коментарів користувача',
    11 => 'Немає коментарів користувача',
    12 => 'Користувацькі вподобання для',
    13 => 'Відсилати нічний дайджест поштою',
    14 => 'Цей пароль створено ґенератором випадкових рядків. Радимо негайно змінити цей пароль! Щоб зробити це, зареєструйтеся й клацніть &laquo;Інформація про рахунок&raquo; з меню &laquo;Функції користувача&raquo;.',
    15 => "Ваш профіль для {$_CONF['site_name']} успішно створено. Щоб мати змогу ним скористатись, вам потрібно увійти до системи, використавши нижчеподану інформацію. Будь ласка, збережіть листа для подальшого використання.",
    16 => 'Інформація про ваш профіль',
    17 => 'Профіль не існує', 
    18 => 'Подана адреса електронної пошти не скидається на дійсну',
    19 => 'Подане реєстраційне ім\'я чи адресу електронної пошти вже зареєстровано',
    20 => 'Подана поштова адреса не скидається на дійсну',
    21 => 'Помилка',
    22 => "Зареєструйтесь на {$_CONF['site_name']}!",
    23 => "Створення користувацького профілю надасть вам усі переваги членства на сайті {$_CONF['site_name']}, як також дозволить вам розміщувати дописи й публікувати матеріали від власного імені. Якщо у вас нема профілю, розмістити матеріал можна буде лише анонімно. Зауважте, що ваша поштова адреса <b><i>ніколи</i></b> не публікуватиметься в нас на сайті.",
    24 => 'Ваш пароль надішлеться на подану вами поштову адресу.',
    25 => 'Ви забули свій пароль?',
    26 => 'Впишіть <em>або</em> своє реєстраційне ім\'я, <em>або</em> або використану при реєстрації поштову адресу, після чого клацніть &laquo;Надіслати пароль&raquo;. Інструкції щодо встановлення нового паролю будуть надіслані на адресу в нашій базі даних.',
    27 => 'Зареєструйте мене!',
    28 => 'Надіслати пароль',
    29 => 'розреєструвався з',
    30 => 'зареєструвався з',
    31 => 'Обрана вами функція вимагає від вас реєстрації',
    32 => 'Підпис',
    33 => 'Ніколи не показується прилюдно',
    34 => 'Це ваше справжнє ім\'я',
    35 => 'Введіть пароль для його зміни',
    36 => 'Починається з http://',
    37 => 'Долучується до ваших коментарів',
    38 => 'Усе це &mdash; про вас! Кожен може це прочитати',
    39 => 'Ваш публічний ключ PGP для розповсюдження',
    40 => 'Немає значків для теми',
    41 => 'Бажаю бути наглядачем',
    42 => 'Формат дати',
    43 => 'Максимальна кількість статей',
    44 => 'Без віконець', // boxes
    45 => 'Вподобання щодо показу для',
    46 => 'Вилучені елементи для',
    47 => 'Налаштування віконця новин для',
    48 => 'Теми',
    49 => 'Без значків біля статей',
    50 => 'Зніміть позначку, якщо це вас не цікавить',
    51 => 'Лише статті-новини',
    52 => 'Усталено:',
    53 => 'Отримувати статті дня щовечора',
    54 => 'Позначте теми й авторів, котрих не бажаєте бачити.',
    55 => 'Якщо ви не залишите позначок, це означатиме усталений вибір віконець. Почавши вибирати віконця, пам\'ятайте встановити всі, які бажаєте, бо усталений вибір знехтується. Усталені елементи показано погрубшеним шрифтом.',
    56 => 'Автори',
    57 => 'Режим показу',
    58 => 'Спосіб упорядкування',
    59 => 'Обмеження коментарів',
    60 => 'Як вам показувати ваші коментарі?',
    61 => 'Спершу найновіші чи найстаріші?',
    62 => 'Початково 100',
    63 => "Ваш пароль вислано вам поштою, за хвилю він повинен прийти. Будь ласка, виконайте описані в листі кроки; дякуємо за використання {$_CONF['site_name']}!",
    64 => 'Вподобання щодо коментарів для',
    65 => 'Спробуйте зареєструватись іще раз',
    66 => "Ви могли помились при вписуванні реєстраційних даних. Спробуйте ввійти ще раз, нижче. Чи ви <a href=\"{$_CONF['site_url']}/users.php?mode=new\">новий користувач</a>?",
    67 => 'Учасник від',
    68 => 'Пам\'ятати мене',
    69 => 'Як довго нам пам\'ятати вас після входу до системи?',
    70 => "Облаштувати зовнішній вигляд і вміст {$_CONF['site_name']}",
    71 => "Чудовою властивістю сайту {$_CONF['site_name']} є те, що ви можете налаштувати для себе отримуваний вміст і повністю змінити загальний макет сайту. Аби цим скористатись, ви спершу повинні <a href=\"{$_CONF['site_url']}/users.php?mode=new\">записатись</a> на {$_CONF['site_name']}. Ви вже учасник? Скористайтесь формою ліворуч і ввійдіть на сайт!",
    72 => 'Тема',
    73 => 'Мова',
    74 => 'Змініть зовнішність сайту!',
    75 => 'Надсилані теми для',
    76 => 'Вибравши тему з нижчеподаного списку, ви отримуватимете всі нові статті на цю тему під кінець кожного дня. Оберіть лише теми, котрі вас цікавлять!',
    77 => 'Світлина',
    78 => 'Додайте власну світлину!',
    79 => 'Позначте тут, щоб видалити поточну світлину',
    80 => 'Увійти',
    81 => 'Надіслати листа',
    82 => 'Останні 10 статей користувача',
    83 => 'Статистика публікацій користувача',
    84 => 'Всього статей:',
    85 => 'Всього коментарів:',
    86 => 'Знайти все, надіслане',
    87 => 'Ваше реєстраційне ім\'я',
    88 => "Хтось (можливо, ви) замовив новий пароль для вашого профілю \"%s\" на {$_CONF['site_name']}, <{$_CONF['site_url']}>.\n\nЯкщо ви справді бажаєте, щоб ця дія відбулась, будь ласка, клацніть ось це посилання:\n\n",
    89 => "Якщо ви не хочете виконання цієї дії, просто знехтуйте це повідомлення й запит також буде знехтувано (ваш пароль залишиться без змін).\n\n", // END HERE
    90 => 'Нижче ви можете ввести новий пароль для свого профілю. Зауважте: ваш пароль залишиться в силі, доки ви не надішлете цю форму.',
    91 => 'Встановити новий пароль',
    92 => 'Впишіть новий пароль',
    93 => 'Ваш останній запит на новий пароль відбувся %d секунд тому. Цей сайт вимагає щонайменше %d секунд між такими запитами.',
    94 => 'Вилучити рахунок "%s"',
    95 => 'Клацніть кнопку "вилучити рахунок", що нижче, для усунення вашого рахунку з нашої бази даних. Зауважте, що всі статті та коментарі, залишені вами під цим рахунком, <strong>не видалятимуться</strong>, а показуватимуться як надіслані анонімно.',
    96 => 'вилучити профіль',
    97 => 'Підтвердіть вилучення профілю',
    98 => 'Ви впевнені, що бажаєте вилучити свій профіль? Зробивши це, ви не зможете ввійти на цей сайт знову (хіба що створите новий профіль). Якщо ви певні щодо цього, клацніть кнопку &laquo;вилучити профіль&raquo; ще раз на формі, що нижче.',
    99 => 'Налаштування приватності для',
    100 => 'Пошта від адміністраторів',
    101 => 'Дозволити пошту від адміністраторів сайту',
    102 => 'Пошта від користувачів',
    103 => 'Дозволити пошту від інших користувачів',
    104 => 'Показувати ваш стан на лінії',
    105 => 'Показувати у віконці &laquo;хто на лінії&raquo;',
    106 => 'Місцеперебування',
    107 => 'Показувати у вашому публічному профілі'
);

###############################################################################
# index.php

$LANG05 = array(
    1 => 'Нема новин до показу',
    2 => 'Нема новин до показу. Можливо, на цю тему немає новин, або ж ваші вподобання занадто обмежувальні',
    3 => " для теми &laquo;%s&raquo;",
    4 => 'Вибрана сьогодні стаття',
    5 => 'Наступна',
    6 => 'Попередня',
    7 => 'Перша',
    8 => 'Остання'
);

###############################################################################
# links.php

$LANG06 = array(
    1 => 'Ресурси Тенет',
    2 => 'Нема ресурсів до показу.',
    3 => 'Додати посилання'
);

###############################################################################
# pollbooth.php

$LANG07 = array(
    1 => 'Голос збережено',
    2 => 'Ваш голос збережено для опитування',
    3 => 'Голос',
    4 => 'Опитування в системі',
    5 => 'голосів',
    6 => 'Переглянути інші опитування'
);

###############################################################################
# profiles.php

$LANG08 = array(
    1 => 'При відправленні повідомлення сталась помилка. Будь ласка, спробуйте ще раз.',
    2 => 'Повідомлення успішно відправлене.',
    3 => 'Будь ласка, впевніться, що використовуєте дійсну адресу електронної пошти в полі &laquo;Відповідати на&raquo;.',
    4 => 'Будь ласка, заповніть поля &laquo;Ваше ім\'я&raquo;, &laquo;Відповідати на&raquo;, &laquo;Тема&raquo; й &laquo;Повідомлення&raquo;',
    5 => 'Помилка: Нема такого користувача.',
    6 => 'Сталась помилка.',
    7 => 'Профіль користувача для',
    8 => 'Реєстраційне ім\'я',
    9 => 'URL користувача',
    10 => 'Надсилати пошту на',
    11 => 'Ваше ім\'я:',
    12 => 'Відповідати на:',
    13 => 'Тема:',
    14 => 'Повідомлення:',
    15 => 'HTML не дозволено.',
    16 => 'Відіслати повідомлення',
    17 => 'Надіслати другові цю статтю листом',
    18 => 'На ім\'я',
    19 => 'На адресу електронної пошти',
    20 => 'Від імені',
    21 => 'Від адреси електронної пошти',
    22 => 'Всі поля є обов\'язковими до заповнення',
    23 => "Цього листа вам надіслано від %s о %s, бо він(вона) вважає, що вас зацікавить стаття {$_CONF['site_url']}. Це не є спамом; залучені адреси електронної пошти не занесено в список і не збережено для подальшого вжитку.",
    24 => 'Коментуйте цю статтю на',
    25 => 'Для використання цієї функції ви повинні зареєструватись у системі. Примусова реєстрація допомагає нам запобігти неправильному використанню системи.',
    26 => 'Ця форма дозволить вам надіслати листа вибраному користувачеві. Всі поля є обов\'язковими.',
    27 => 'Коротке повідомлення',
    28 => "%s написав(-ла): ",
    29 => "Це &mdash; щоденний дайджест сайту {$_CONF['site_name']} для ",
    30 => ' Щоденна розсилка новин ', // newsletter
    31 => 'Назва',
    32 => 'Дата',
    33 => 'Читайте повний текст статті на',
    34 => 'Кінець повідомлення',
    35 => 'Вибачте, цьому користувачеві до вподоби не отримувати жодних листів.'
);

###############################################################################
# search.php

$LANG09 = array(
    1 => 'Складний пошук',
    2 => 'Ключові слова',
    3 => 'Тема',
    4 => 'Всі',
    5 => 'Тип',
    6 => 'Статті',
    7 => 'Коментарі',
    8 => 'Автори',
    9 => 'Всі',
    10 => 'Шукати',
    11 => 'Шукати серед знайденого',
    12 => 'співпадань',
    13 => 'Результат пошуку: без співпадань',
    14 => 'Не знайдено співпадань для вашого пошуку',
    15 => 'Будь ласка, спробуйте ще раз.',
    16 => 'Назва',
    17 => 'Дата',
    18 => 'Автор',
    19 => "Перешукати всю базу даних поточних і старих статей-новин на сайті {$_CONF['site_name']}",
    20 => 'Дата з',
    21 => 'по',
    22 => '(Вигляд дати РРРР-ММ-ДД)',
    23 => 'Перегляди',
    24 => 'Знайдено %d матеріалів',
    25 => 'Ви шукали',
    26 => 'матеріалів ',
    27 => 'секунд',
    28 => 'Для вашого пошуку не знайдено ні підхожих статей, ні коментарів',
    29 => 'Результати пошуку в статтях і коментарях',
    30 => 'Вашим умовам пошуку не відповідає жодне посилання',
    31 => 'Ця втулка не повернула жодного результату',
    32 => 'Подія',
    33 => 'URL',
    34 => 'Місцезнаходження',
    35 => 'Цілий день',
    36 => 'Вашим умовам пошуку не віповідає жодна подія',
    37 => 'Результати пошуку серед подій',
    38 => 'Результати пошуку серед посилань',
    39 => 'Посилання',
    40 => 'Події',
    41 => 'Рядок вашого запиту повинен містити щонайменше 3 символи.',
    42 => 'Будь ласка, використовуйте дати у вигляді РРРР-ММ-ДД (рік-місяць-день).',
    43 => 'точна фраза',
    44 => 'всі ці слова',
    45 => 'будь-які з цих слів',
    46 => 'Наступні',
    47 => 'Попередні',
    48 => 'Автор',
    49 => 'Дата',
    50 => 'Відвідувань',
    51 => 'Посилання',
    52 => 'Місцезнаходження',
    53 => 'Результати для статей',
    54 => 'Результати для коментарів',
    55 => 'фразу',
    56 => 'І',
    57 => 'АБО'
);

###############################################################################
# stats.php

$LANG10 = array(
    1 => 'Статистика сайту',
    2 => 'Всього звертань до системи',
    3 => 'Статей(Коментарів) у системі',
    4 => 'Опитувань(Відповідей) у системі',
    5 => 'Посилань(Клацань) у системі',
    6 => 'Подій у системі',
    7 => 'Десятка найпопулярніших статей',
    8 => 'Назва статті',
    9 => 'Переглядів',
    10 => 'Схоже, на цьому сайті нема статей, або ж їх ніхто ніколи не читав.',
    11 => 'Десятка найобговорюваніших статей',
    12 => 'Коментарі',
    13 => 'Схоже, на цьому сайті нема статей, або ж їх ніхто ніколи не коментував.',
    14 => 'Десятка найпопулярніших опитувань',
    15 => 'Запитання',
    16 => 'Голосів',
    17 => 'Схоже, на цьому сайті нема опитувань, або ж у них ніхто ніколи не голосував.',
    18 => 'Десятка найпопулярніших посилань',
    19 => 'Посилання',
    20 => 'Відвідувань',
    21 => 'Схоже, на цьому сайті нема посилань, або ж на жодній з них ніхто ніколи не клацав.',
    22 => 'Десятка найчастіше відсиланих поштою статей',
    23 => 'Листів',
    24 => 'Схоже, на цьому сайті ніхто не надсилав поштою жодної статті.'
);

###############################################################################
# article.php

$LANG11 = array(
    1 => 'Подібне',
    2 => 'Надіслати статтю другові',
    3 => 'Стаття у вигляді для друку',
    4 => 'Налаштування статті',
    5 => 'Стаття в форматі PDF'
);

###############################################################################
# submit.php

$LANG12 = array(
    1 => "Щоб розмістити %s, ви повинні зареєструватись як користувач.",
    2 => 'Зареєструватись',
    3 => 'Новий користувач',
    4 => 'Розмістити подію',
    5 => 'Розмістити посилання',
    6 => 'Розмістити статтю',
    7 => 'Вимагається реєстрація',
    8 => 'Розмістити',
    9 => 'Просимо при розміщенні матеріалів тут на сайті додержувати цих порад:<ul><li>Заповніть усі поля, вони обов\'язкові<li>Надавайте повні й точні відомості<li>Перевірте посилання двічі</ul>',
    10 => 'Назва',
    11 => 'Посилання',
    12 => 'Дата початку',
    13 => 'Дата закінчення',
    14 => 'Місце',
    15 => 'Опис',
    16 => 'Вкажіть, якщо якась інша',
    17 => 'Категорія',
    18 => 'Інше',
    19 => 'Спершу прочитайте',
    20 => 'Помилка: бракує категорії',
    21 => 'Вибравши &laquo;Інше&raquo;, вкажіть також і назву категорії',
    22 => 'Помилка: бракує полів',
    23 => 'Будь ласка, заповніть усі поля форми. Вони обов\'язкові.',
    24 => 'Публікацію збережено',
    25 => "Вашу публікацію %s успішно збережено.",
    26 => 'Обмеження швидкості',
    27 => 'Реєстраційне ім\'я',
    28 => 'Тема',
    29 => 'Стаття',
    30 => 'Ви востаннє публікувались ',
    31 => " секунд(и) тому. Цей сайт вимагає щонайменше {$_CONF['speedlimit']} секунд між публікаціями.",
    32 => 'Попередній перегляд',
    33 => 'Попередній перегляд статті',
    34 => 'Розреєструватись',
    35 => 'Розмітку HTML не дозволено',
    36 => 'Режим відправлення',
    37 => "Публікація події на сайті {$_CONF['site_name']} розмістить вашу подію на головному календарі, звідки користувачі зможуть додавати її до особистих календарів. Ця функція <b>НЕ</b> призначена зберігати ваші особисті події, як-от дні народження та річниці.<br><br>Після розміщення подію буде надіслано нашим адміністраторам, і після їхнього схвалення ваша подія з'явиться на головному календарі.",
    38 => 'Додати подію до',
    39 => 'головного календаря',
    40 => 'особистого календаря',
    41 => 'Час завершення',
    42 => 'Час початку',
    43 => 'Подія цілого дня',
    44 => 'Рядок адреси 1',
    45 => 'Рядок адреси 2',
    46 => 'Місто',
    47 => 'Штат',
    48 => 'Поштовий індекс',
    49 => 'Тип події',
    50 => 'Редагувати типи подій',
    51 => 'Місце',
    52 => 'Викреслити',
    53 => 'Створити рахунок'
);

###############################################################################
# ADMIN PHRASES - These are file phrases used in admin scripts
###############################################################################

###############################################################################
# admin/auth.inc.php

$LANG20 = array(
    1 => 'Вимагається автентифікація',
    2 => 'Відмовлено! Невірна реєстраційна інформація',
    3 => 'Невірний пароль для користувача',
    4 => 'Реєстраційне ім\'я:',
    5 => 'Пароль:',
    6 => 'Увесь доступ до адміністративних частин цього сайту протоколюється і наглядається.<br>Ця сторінка призначена лише для допущеного персоналу.',
    7 => 'увійти'
);

###############################################################################
# admin/block.php

$LANG21 = array(
    1 => 'Бракує адміністративних прав',
    2 => 'Ви не маєте достатніх прав для редагування цього блоку.',
    3 => 'Редактор блоків',
    4 => 'При читанні цієї трансляції виник клопіт (за подробицями дивіться error.log).',
    5 => 'Назва блоку',
    6 => 'Тема',
    7 => 'Всі',
    8 => 'Рівень безпеки блоку',
    9 => 'Порядок блоку',
    10 => 'Тип блоку',
    11 => 'Блок порталу',
    12 => 'Звичайний блок',
    13 => 'Налаштування портального блоку',
    14 => 'URL для RSS',
    15 => 'Останнє поновлення RSS',
    16 => 'Налаштування для звичайного блоку',
    17 => 'Вміст блоку',
    18 => 'Будь ласка, заповніть поля для назви та вмісту блоку',
    19 => 'Керування блоками',
    20 => 'Назва блоку',
    21 => 'Рівень безпеки блоку',
    22 => 'Тип блоку',
    23 => 'Порядок блоку',
    24 => 'Тема блоку',
    25 => 'Аби змінити чи вилучити блок, клацніть на ньому нижче. Щоб створити новий блок, клацніть &laquo;Новий блок&raquo; вище.',
    26 => 'Блок макету',
    27 => 'Блок PHP',
    28 => 'Налаштування блоку PHP',
    29 => 'Функція блоку',
    30 => 'Якщо ви б хотіли використати код PHP в одному зі своїх блоків, введіть назву функції вище. Назва вашої функції повинна починатися з "phpblock_" (наприклад, phpblock_getweather).  Якщо функція не матиме такого префіксу, вона не буде викликана. Це зроблено, щоб стримати людей, котрі могли б уламатись до вашої інсталяції Geeklog, від виклику довільних функцій, що зашкодили б вашій системі.  Упевніться, що після назви функції НЕ йдуть порожні дужки "()". Нарешті, радиться, щоб ви розмістили весь свій код блоку PHP в /path/to/geeklog/system/lib-custom.php. Тоді цей код залишиться навіть коли ви поновите Geeklog до новішої версії.',
    31 => 'Помилка в блоці PHP. Функція %s не існує.',
    32 => 'Помилка &mdash; брак поля (полів)',
    33 => 'Ви повинні ввести URL до файлу RSS для портальних блоків',
    34 => 'Ви повинні ввести назву й функцію для блоків PHP',
    35 => 'Ви повинні ввести назву та вміст для звичайних блоків',
    36 => 'Ви повинні ввести вміст для макетних блоків',
    37 => 'Недопустима назва функції для блоку PHP',
    38 => 'Функції для блоків PHP повинні мати префікс &laquo;phpblock_&raquo; (наприклад, phpblock_getweather). Префікс &laquo;phpblock_&raquo; вимагається з міркувань безпеки, щоб запобігти виконанню довільного коду.',
    39 => 'Боковий', // side
    40 => 'Ліворуч',
    41 => 'Праворуч',
    42 => 'Необхідно ввести назву й порядок блоку для усталених блоків Geeklog.',
    43 => 'Лише домашня сторінка',
    44 => 'В доступі відмовлено',
    45 => "Ви намагаєтесь доступитись до блоку, на який не маєте прав. Цю спробу запротокольовано. Будь ласка, <a href=\"{$_CONF['site_admin_url']}/block.php\">поверніться на сторінку адміністрування блоків</a>.",
    46 => 'Новий блок',
    47 => 'Домівка адміністратора',
    48 => 'Назва блоку',
    49 => ' (повинен бути без пробілів і мати унікальну назву)',
    50 => 'URL файлу довідки',
    51 => 'включіть http://',
    52 => 'Якщо залишити це поле порожнім, значок довідки для цього блоку не показуватиметься',
    53 => 'Увімкнено',
    54 => 'зберегти',
    55 => 'скасувати',
    56 => 'вилучити',
    57 => 'Перемістити блок донизу',
    58 => 'Перемістити блок догори',
    59 => 'Перемістити блок праворуч',
    60 => 'Перемістити блок ліворуч'
);

###############################################################################
# admin/event.php

$LANG22 = array(
    1 => 'Редактор подій',
    2 => 'Помилка',
    3 => 'Назва події',
    4 => 'URL події',
    5 => 'Дата початку події',
    6 => 'Дата кінця події',
    7 => 'Місце події',
    8 => 'Опис події',
    9 => '(включіть http://)',
    10 => 'Ви повинні подати дати/час, назву події й її опис',
    11 => 'Менеджер подій',
    12 => 'Для зміни чи вилучення події клацніть на ній нижче. Для створення нової події клацніть &laquo;нову подію&raquo; вгорі. Клацніть [C] для створення копії наявної вже події.',
    13 => 'Назва події',
    14 => 'Дата початку',
    15 => 'Дата кінця',
    16 => 'В доступі відмовлено',
    17 => "Ви намагаєтесь доступитись до події, на котру не маєте прав. Цю спробу запротокольовано. Будь ласка, <a href=\"{$_CONF['site_admin_url']}/event.php\">поверніться на стоорінку адміністрування подій</a>.",
    18 => 'Нова подія',
    19 => 'Домівка адміністратора',
    20 => 'зберегти',
    21 => 'скасувати',
    22 => 'вилучити',
    23 => 'Неправильна початкова дата.',
    24 => 'Невірна кінцева дата.',
    25 => 'Кінцева дата настає перед початковою.'
);

###############################################################################
# admin/link.php

$LANG23 = array(
    1 => 'Редактор посилань',
    2 => '',
    3 => 'Назва посилання',
    4 => 'URL посилання',
    5 => 'Категорія',
    6 => '(включіть http://)',
    7 => 'Інше',
    8 => 'Звернень до посилання', // Link Hits -- вцілювання, звернення, потрапляння
    9 => 'Опис посилання',
    10 => 'Ви повинні подати назву посилання, його URL опис.',
    11 => 'Менеджер посилань',
    12 => 'Щоб виправити чи вилучити посилання, клацніть на цьому посиланні нижче. Для створення нового посилання клацніть &laquo;нове посилання&raquo; вище.',
    13 => 'Назва посилання',
    14 => 'Категорія посилання',
    15 => 'URL посилання',
    16 => 'В доступі відмовлено',
    17 => "Ви намагаєтесь отримати доступ до посилання, до якого не маєте права. Цю спробу запротокольовано. Будь ласка, <a href=\"{$_CONF['site_admin_url']}/link.php\">поверніться на сторінку адміністрування посилань</a>.",
    18 => 'Нове посилання',
    19 => 'Домівка адміністратора',
    20 => 'Якщо інше, вкажіть',
    21 => 'зберегти',
    22 => 'скасувати',
    23 => 'вилучити'
);

###############################################################################
# admin/story.php

$LANG24 = array(
    1 => 'Попередні статті',
    2 => 'Наступні статті',
    3 => 'Режим',
    4 => 'Режим допису',
    5 => 'Редактор статей',
    6 => 'В системі немає статей',
    7 => 'Автор',
    8 => 'зберегти',
    9 => 'попередній перегляд',
    10 => 'скасувати',
    11 => 'вилучити',
    12 => 'Ідентифікатор',
    13 => 'Назва',
    14 => 'Тема',
    15 => 'Дата',
    16 => 'Текст вступу',
    17 => 'Основний текст',
    18 => 'Звертань',
    19 => 'Коментарів',
    20 => '',
    21 => '',
    22 => 'Перелік статей',
    23 => 'Щоб виправити чи вилучити статтю, клацніть на номері цієї статті нижче. Щоб переглянути статтю, клацніть назву бажаної статті. Для створення нової статті клацніть &laquo;Нова стаття&raquo; вище.',
    24 => 'Обраний вами ідентифікатор для статті вже використовується. Будь ласка, використайте інший.',
    25 => '',
    26 => 'Попередній перегляд статті',
    27 => '',
    28 => '',
    29 => '',
    30 => 'Помилка при завантаженні файлу',
    31 => 'Будь ласка, заповніть поля &laquo;Назва&raquo; та &laquo;Текст вступу&raquo;',
    32 => 'Вибрана',
    33 => 'Вибраною може бути лише одна стаття',
    34 => 'Чернетка',
    35 => 'Так',
    36 => 'Ні',
    37 => 'Більше від', // TODO
    38 => 'Більше з', // TODO
    39 => 'Пошта',
    40 => 'В доступі відмовлено',
    41 => "Ви намагаєтесь отримати доступ до статті, на яку не маєте прав. Цю спробу запротокольовано. Нижче ви можете прочитати цю статтю в режимі тільки для перегляду. Будь ласка, по закінченні <a href=\"{$_CONF['site_admin_url']}/story.php\">поверніться на сторінку адміністрування статей</a>.",
    42 => "Ви намагаєтесь отримати доступ до статті, на яку не маєте прав. Цю спробу запротокольовано. Будь ласка, <a href=\"{$_CONF['site_admin_url']}/story.php\">поверніться на сторінку адміністрування статей</a>.",
    43 => 'Нова стаття',
    44 => 'Домівка адміністратора',
    45 => 'Доступ',
    46 => '<b>УВАГА:</b> якщо ви зміните цю дату так, що вона буде в майбутньому, стаття не опублікується до настання цієї дати. Це також означає, що цю статтю не буде включено у вашу трансляцію заголовків RSS, а також вона буде знехтувана на сторінках пошуку та статистики.',
    47 => 'Зображення',
    48 => 'зображення',
    49 => 'праворуч',
    50 => 'ліворуч',
    51 => 'Щоб додати одне з зображень, котрі ви долучаєте до цієї статті, вам необхідно вставити особливим чином розмічений текст. Таким текстом є [imageX], [imageX_right] або [imageX_left], де X &mdash; це номер долученого зображення. УВАГА: ви повинні використати долучувані зображення. Інакше ви не зможете зберегти свою статтю.<br><p><b>ПОПЕРЕДНІЙ ПЕРЕГЛЯД</b>: Попередній перегляд статті з долученими зображеннями найкраще здійснювати, зберігаючи статтю як чернетку, А НЕ натискаючи кнопку &laquo;попередній перегляд&raquo;. Використовуйте цю кнопку лише тоді, коли долучених зображень немає.',
    52 => 'Вилучити',
    53 => 'не використано. Ви повинні включити це зображення у вступ чи основний текст, перш ніж зможете зберегти цю статтю',
    54 => 'Невикористані долучені зображення',
    55 => 'При зберіганні вашої статті стались наступні помилки. Будь ласка, виправте їх перед зберіганням',
    56 => 'Показувати значок теми',
    57 => 'Переглянути зображення в натуральну величину',
    58 => 'Керування статтями',
    59 => 'Опція', // Option
    60 => 'Увімкнено',
    61 => 'Автоархівування',
    62 => 'Автовилучення'
);

###############################################################################
# admin/poll.php

$LANG25 = array(
    1 => 'Режим',
    2 => 'Будь ласка, введіть запитання та щонайменше одну відповідь.',
    3 => 'Опитування створено',
    4 => "Опитування %s збережено",
    5 => 'Редагувати опитування',
    6 => 'Ідентифікатор опитування',
    7 => '(не використовуйте пробілів)',
    8 => 'Видне на головній сторінці',
    9 => 'Запитання',
    10 => 'Відповіді / Голоси',
    11 => "При отриманні даних для відповідей опитування %s сталась помилка",
    12 => "При отриманні даних для запитання опитування %s сталась помилка",
    13 => 'Створити опитування',
    14 => 'зберегти',
    15 => 'скасувати',
    16 => 'вилучити',
    17 => 'Будь ласка, введіть ідентифікатор опитування',
    18 => 'Перелік опитувань',
    19 => 'Аби змінити чи вилучити опитування, клацніть на цьому опитуванні. Щоб створити нове опитування, клацніть &laquo;Нове опитування&raquo; вище.',
    20 => 'Голосували',
    21 => 'В доступі відмовлено',
    22 => "Ви намагаєтесь отримати доступ до опитування, до якого не маєте прав. Цю спробу запротокольовано. Будь ласка, <a href=\"{$_CONF['site_admin_url']}/poll.php\">поверніться на сторінку адміністрування опитувань</a>.",
    23 => 'Нове опитування',
    24 => 'Домівка адміністратора',
    25 => 'Так',
    26 => 'Ні'
);

###############################################################################
# admin/topic.php

$LANG27 = array(
    1 => 'Редактор тем',
    2 => 'Ідентифікатор теми',
    3 => 'Назва теми',
    4 => 'Зображення теми',
    5 => '(не використовуйте пробілів)',
    6 => 'Вилучення теми видалить також усі пов\'язані з нею статті й блоки',
    7 => 'Будь ласка, заповніть поля &laquo;Ідентифікатор теми&raquo; й &laquo;Назва теми&raquo;',
    8 => 'Менеджер тем',
    9 => 'Аби змінити чи вилучити тему, клацніть на ній. Щоб створити нову тему, клацніть кнопку &laquo;нова тема&raquo;, що ліворуч. В дужках ви знайдете свій рівень доступу до кожної теми. Зірочка (*) позначає усталену тему.',
    10 => 'Порядок сортування',
    11 => 'Статей/Сторінка',
    12 => 'В доступі відмовлено',
    13 => "Ви намагаєтесь отримати доступ до теми, на яку не маєте прав. Цю спробу запротокольовано. Будь ласка, <a href=\"{$_CONF['site_admin_url']}/topic.php\">поверніться на сторінку адміністрування тем</a>.",
    14 => 'Спосіб сортування',
    15 => 'абетковий',
    16 => 'усталено',
    17 => 'Нова тема',
    18 => 'Домівка адміністратора',
    19 => 'зберегти',
    20 => 'скасувати',
    21 => 'вилучити',
    22 => 'Усталено',
    23 => 'зробити цю тему усталеною для новонадісланих статей',
    24 => '(*)',
    25 => 'Архівна тема',
    26 => 'зробити цю тему усталеною для архівних статей. Дозволено лише одну таку тему.'
);

###############################################################################
# admin/user.php

$LANG28 = array(
    1 => 'Редактор користувачів',
    2 => 'Ідентифікатор користувача',
    3 => 'Реєстраційне ім\'я користувача',
    4 => 'Повне ім\'я',
    5 => 'Пароль',
    6 => 'Рівень безпеки',
    7 => 'Електронна адреса',
    8 => 'Домівка',
    9 => '(не використовуйте пробілів)',
    10 => 'Будь ласка, заповніть поля &laquo;Реєстраційне ім\'я користувача&raquo; й &laquo;Електронна адреса&raquo;',
    11 => 'Менеджер користувачів',
    12 => 'Аби змінити чи вилучити користувача, клацніть на ньому нижче. Для створення нового користувача клацніть кнопку &laquo;новий користувач&raquo; ліворуч. Ви можете здійснювати простий пошук, вводячи частини реєстраційного імені, повного імені й електронної адреси (наприклад, *son* або *.edu) в нижчеподану форму.',
    13 => 'РівБезп',
    14 => 'Дата реєстрації',
    15 => 'Новий користувач',
    16 => 'Домівка адміністратора',
    17 => 'changepw',
    18 => 'скасувати',
    19 => 'вилучити',
    20 => 'зберегти',
    21 => 'Ім\'я користувача, котре ви намагалися зберегти, вже існує.',
    22 => 'Помилка',
    23 => 'Пакетне додавання',
    24 => 'Пакетне імпортування користувачів',
    25 => 'Ві можете заімпортувати в Geeklog пакет користувачів. Файл для імпорту мусить бути текстовим файлом з полями, розділеними табуляціями. Ось поля та їх порядок: повне ім\'я, реєстраційне ім\'я, електронна адреса. Кожному імпортованому користувачеві буде надіслано випадково підібраний пароль. Дані про кожного користувача повинні міститися в окремому рядку. Невиконання цих вказівок може спричинити клопоти, котрі вимагатимуть ручного втручання, тож перевірте добре всі поля!',
    26 => 'Пошук',
    27 => 'Обмежити результати',
    28 => 'Відмітьте тут, якщо бажаєте стерти зображення',
    29 => 'Шлях',
    30 => 'Імпорт',
    31 => 'Нові користувачі',
    32 => 'Обробку завершено. Імпортовано %d користувачів, сталося %d невдач',
    33 => 'надіслати',
    34 => 'Помилка: ви повинні вказати файл для завантаження.',
    35 => 'Остання реєстрація',
    36 => '(ніколи)'
);

###############################################################################
# admin/moderation.php

$LANG29 = array(
    1 => 'Схвалити',
    2 => 'Видалити',
    3 => 'Редагувати',
    4 => 'Профіль',
    10 => 'Назва',
    11 => 'Дата початку',
    12 => 'URL',
    13 => 'Категорія',
    14 => 'Дата',
    15 => 'Тема',
    16 => 'Реєстраційне ім\'я',
    17 => 'Повне ім\'я',
    18 => 'Email',
    34 => 'Command and Control',
    35 => 'Надіслані статті',
    36 => 'Надіслані посилання',
    37 => 'Надіслані події',
    38 => 'Надіслати',
    39 => 'Наразі немає матеріалів для модерації',
    40 => 'Користувацькі публікації'
);

###############################################################################
# calendar.php

$LANG30 = array(
    1 => 'Неділя',
    2 => 'Понеділок',
    3 => 'Вівторок',
    4 => 'Середа',
    5 => 'Четвер',
    6 => 'П\'ятниця',
    7 => 'Субота',
    8 => 'Додати подію',
    9 => '%s Event',
    10 => 'Події для',
    11 => 'Головний календар',
    12 => 'Мій календар',
    13 => 'Січень',
    14 => 'Лютий',
    15 => 'Березень',
    16 => 'Квітень',
    17 => 'Травень',
    18 => 'Червень',
    19 => 'Липень',
    20 => 'Серпень',
    21 => 'Вересень',
    22 => 'Жовтень',
    23 => 'Листопад',
    24 => 'Грудень',
    25 => 'Повернутись до ',
    26 => 'Весь день',
    27 => 'Тиждень',
    28 => 'Особистий календар для',
    29 => 'Публічний календар',
    30 => 'витерти подію',
    31 => 'Додати',
    32 => 'Подія',
    33 => 'Дата',
    34 => 'Час',
    35 => 'Швидке додавання',
    36 => 'Надіслати',
    37 => 'Пробачте, функція особистих календарів не дозволена на цьому сайті',
    38 => 'Редактор особистих подій',
    39 => 'День',
    40 => 'Тиждень',
    41 => 'Місяць'
);

###############################################################################
# admin/mail.php

$LANG31 = array(
    1 => "Поштовий засіб {$_CONF['site_name']}",
    2 => 'Від',
    3 => 'Відповідати на',
    4 => 'Тема',
    5 => 'Текст',
    6 => 'Кому надіслати:',
    7 => 'Всім користувачам',
    8 => 'Admin',
    9 => 'Налаштування',
    10 => 'HTML',
    11 => 'Термінове повідомлення!',
    12 => 'Надіслати',
    13 => 'Скинути',
    14 => 'Знехтувати користувацькими налаштуваннями',
    15 => 'Помилка при відсиланні до: ',
    16 => 'Успішно відіслано повідомлення до: ',
    17 => "<a href={$_CONF['site_admin_url']}/mail.php>Надіслати ще повідомлення</a>",
    18 => 'До',
    19 => 'УВАГА: якщо ви бажаєте надіслати повідомлення всім учасникам, виберіть зі списку групу &laquo;Зареєстровані користувачі&raquo;.',
    20 => "Успішно послано <successcount> повідомлення, а <failcount> повідомлень не вдалось надіслати. 
	Якщо вам потрібні подробиці, ви можете переглянути їх про кожне повідомлення нижче.  
	Або ж можна <a href=\"{$_CONF['site_admin_url']}/mail.php\">Надіслати ще повідомлення</a> або <a href=\"{$_CONF['site_admin_url']}/moderation.php\">повернутись на адміністраторську сторінку</a>.",
    21 => 'Невдач',
    22 => 'Успішних операцій',
    23 => 'Нема невдач',
    24 => 'Нема успішних операцій',
    25 => '-- Виберіть групу --',
    26 => 'Заповніть усі поля форми й виберіть групу користувачів зі списку.'
);

###############################################################################
# admin/plugins.php

$LANG32 = array(
    1 => 'Встановлення втулок може завдати шкоди вашій інсталяції Geeklog і, можливо, вашій системі. Важливо, щоб ви встановлювали лише втулки, звантажені з <a href="http://www.geeklog.net">Домівки Geeklog</a>, оскільки ми ретельно перевіряємо всі надіслані на наш сайт втулки на цілому ряді операційних систем. Важливо, щоб ви розуміли, що процес встановення втулки вимагатиме виконання кількох команд роботи з файловою системою, що може призвести до клопотів з безпекою, особливо ж, якщо ви використовуєте втулки зі сторонніх сайтів. Навіть після цієї остороги, ми не ґарантуємо успіху будь-якого встановлення, ані не відповідаємо за шкоду, спричинену встановленням втулки для Geeklog. Іншими словами, встановлюйте на власний страх і ризик. Для обережних, керівництво зі встановлення втулки власноруч постачається з кожною втулкою.',
    2 => 'Юридичне повідомлення встановлюваної втулки',
    3 => 'Форма встановлення втулки',
    4 => 'Файл втулки',
    5 => 'Перелік втулок',
    6 => 'Увага: втулку вже встановлено!',
    7 => 'Втулка, котру ви намагаєтесь встановити, вже існує. Будь ласка, вилучіть втулку перед її перевстановленням',
    8 => 'Перевірку втулки на сумісність не пройдено',
    9 => 'Ця втулка вимагає новішої версії Geeklog. Або поновіть свій примірник <a href="http://www.geeklog.net">Geeklog</a>, або ж отримайте новішу версію втулки.',
    10 => '<br><b>В даний момент не встановлено жодної втулки.</b><br><br>',
    11 => 'Аби виправити чи вилучити втулку, клацніть на її назві нижче. Це покаже подробиці втулки, в тому числі й сайт автора (авторів). Показуються і встановлена версія, й версія, отримана з коду втулки. Це допоможе вам дізнатись, чи варто поновлювати втулку. Для встановлення чи поновлення втулки зверніться до її супровідної документації.',
    12 => 'plugineditor() не надано назви втулки',
    13 => 'Редактор втулок',
    14 => 'Нова втулка',
    15 => 'Домівка адміністратора',
    16 => 'Назва втулки',
    17 => 'Версія втулки',
    18 => 'Версія Geeklog',
    19 => 'Увімкнена',
    20 => 'Так',
    21 => 'Ні',
    22 => 'Встановити',
    23 => 'Зберегти',
    24 => 'Скасувати',
    25 => 'Вилучити',
    26 => 'Назва втулки',
    27 => 'Домівка втулки',
    28 => 'Встановлена версія',
    29 => 'Версія Geeklog',
    30 => 'Вилучити втулку?',
    31 => 'Ви впевнені, що хочете вилучити цю втулку? Зробивши це, ви усунете також усі дані й структури даних, використовувані цією втулкою. Якщо ви впевнені, клацніть &laquo;вилучити&raquo; ще раз на формі, що нижче.',
    32 => '<p><b>Помилка: невірний формат для мітки AutoLink</b></p>',
    33 => 'Версія коду',
    34 => 'Поновити'

);

###############################################################################
# admin/syndication.php

$LANG33 = array(
    1 => 'створити трансляцію',
    2 => 'зберегти',
    3 => 'вилучити',
    4 => 'скасувати',
    10 => 'Трансляція вмісту',
    11 => 'Нова трансляція',
    12 => 'Домівка адміністратора',
    13 => 'Щоб змінити чи вилучити трансляцію, клацніть на назві трансляції нижче. Для створення нової трансляції клацніть &laquo;Нова трансляція&raquo; вище.',
    14 => 'Назва',
    15 => 'Тип',
    16 => 'Назва файлу',
    17 => 'Формат',
    18 => 'востаннє поновлено',
    19 => 'Дозволено',
    20 => 'Так',
    21 => 'Ні',
    22 => '<i>(нема трансляцій)</i>',
    23 => 'всі статті',
    24 => 'Редактор трансляцій',
    25 => 'Назва трансляції',
    26 => 'Обмеження',
    27 => 'Довжина елементів', // entries
    28 => '(0 = без тексту, 1 = повний текст, все інше = обмежити до цієї кількості символів.)',
    29 => 'Опис',
    30 => 'Останнє поновлення',
    31 => 'Набір символів',
    32 => 'Мова',
    33 => 'Зміст',
    34 => 'Елементи', // entries
    35 => 'Години',
    36 => 'Виберіть тип трансляції',
    37 => 'У вас встановлена щонайменше одна втулка, що підтримує трансляцію вмісту. Нижче вам потрібно буде вибрати, чи ви бажаєте створити трансляцію Geeklog чи трансляцію однієї з втулок.',
    38 => 'Помилка: не вказано трансляцію',
    39 => 'Будь ласка, заповніть поля &laquo;Назва трансляції&raquo;, &laquo;Опис&raquo; і &laquo;Назва файлу&raquo;.',
    40 => 'Будь ласка, вкажіть кількість годин або кількість елементів.',
    41 => 'Посилання',
    42 => 'Події'
);

###############################################################################
# confirmation and error messages

$MESSAGE = array(
    1 => "Ваш пароль відіслано поштою, й він ось-ось повинен до вас надійти. Будь ласка, виконайте вказівки в листі. Дякуємо вам за користування {$_CONF['site_name']}", 
    2 => "Дякуємо за надіслання вашої статті на {$_CONF['site_name']}. Її надіслано нашому штатові для схвалення. Якщо статтю схвалять, вона стане доступною для прочитання іншим.", 
    3 => "Дякуємо за надіслання посилання на {$_CONF['site_name']}. Його надіслано нашому штатові для схвалення. Якщо посилання схвалять, воно стане видимим у розділі <a href={$_CONF['site_url']}/links.php>посилань</a>.",
    4 => "Дякуємо за надіслання події на {$_CONF['site_name']}. Її надіслано нашому штатові для схвалення. Якщо подію схвалять, її буде видно в розділі <a href={$_CONF['site_url']}/calendar.php>календаря</a>.", 
    5 => 'Інформацію про ваш рахунок успішно збережено.',
    6 => 'Ваші вподобання успішно збережено.',
    7 => 'Ваші вподобання щодо коментарів успішно збережено.',
    8 => 'Ви успішно вийшли із системи.',
    9 => 'Вашу статтю успішно збережено.',
    10 => 'Статтю успішно вилучено.',
    11 => 'Ваш блок успішно збережено.',
    12 => 'Блок успішно вилучено.',
    13 => 'Вашу тему успішно збережено.',
    14 => 'Тему, всі її статті та блоки успішно вилучено.',
    15 => 'Ваше посилання успішно збережено.',
    16 => 'Посилання успішно вилучено.',
    17 => 'Вашу подію успішно збережено.',
    18 => 'Подію успішно вилучено.',
    19 => 'Ваше опитування успішно збережено.',
    20 => 'Опитування успішно вилучено.',
    21 => 'Користувача успішно збережено.',
    22 => 'Користувача успішно вилучено.',
    23 => 'Помилка при спробі додати подію до вашого календаря. Не передано ідентифікатор події.',
    24 => 'Подію збережено до вашого календаря',
    25 => 'Ваш особистий календар не вдасться відкрити, поки ви не ввійдете в систему',
    26 => 'Подію успішно усунено з вашого особистого календаря',
    27 => 'Повідомлення успішно відіслано.',
    28 => 'Втулку успішно збережено',
    29 => 'Вибачте, особисті календарі на цьому сайті недозволені',
    30 => 'В доступі відмовлено',
    31 => 'Пробачте, у вас немає доступу до сторінки адміністрування статей. Зауважте, що всі спроби доступу до недозволених функцій протоколюються',
    32 => 'Пробачте, у вас немає доступу до сторінки адміністрування тем. Зауважте, що всі спроби доступу до недозволених функцій протоколюються',
    33 => 'Пробачте, у вас немає доступу до сторінки адміністрування блоків. Зауважте, що всі спроби доступу до недозволених функцій протоколюються',
    34 => 'Пробачте, у вас немає доступу до сторінки адміністрування посилань. Зауважте, що всі спроби доступу до недозволених функцій протоколюються',
    35 => 'Пробачте, у вас немає доступу до сторінки адміністрування подій. Зауважте, що всі спроби доступу до недозволених функцій протоколюються',
    36 => 'Пробачте, у вас немає доступу до сторінки адміністрування опитувань. Зауважте, що всі спроби доступу до недозволених функцій протоколюються',
    37 => 'Пробачте, у вас немає доступу до сторінки адміністрування користувачів. Зауважте, що всі спроби доступу до недозволених функцій протоколюються',
    38 => 'Пробачте, у вас немає доступу до сторінки адміністрування втулок. Зауважте, що всі спроби доступу до недозволених функцій протоколюються',
    39 => 'Пробачте, у вас немає доступу до сторінки адміністрування пошти. Зауважте, що всі спроби доступу до недозволених функцій протоколюються',
    40 => 'Системне повідомлення',
    41 => 'Пробачте, у вас немає доступу до word replacement page. Зауважте, що всі спроби доступу до недозволених функцій протоколюються',
    42 => 'Ваше слово успішно збережене.',
    43 => 'Слово успішно вилучене.',
    44 => 'Втулку успішно встановлено!',
    45 => 'Втулку успішно вилучено.',
    46 => 'Пробачте, у вас немає доступу до засобу резервного копіювання бази даних. Зауважте, що всі спроби доступу до недозволених функцій протоколюються',
    47 => 'Ця функціональність працює лише під *nix. Якщо вашою операційною системою є *nix, тоді кеш успішно очищено. Якщо у вас Windows, вам треба буде пошукати файли за назвою adodb_*.php і усунути їх самостійно.',
    48 => "Дякуємо вам за ваше бажання стати учасником {$_CONF['site_name']}. Наша команда розгляне вашу заяву. В разі ухвали, ваш пароль буде надіслано вам на щойно вами вказану адресу електронної пошти.",
    49 => 'Вашу групу успішно збережено.',
    50 => 'Групу успішно вилучено.',
    51 => 'Це реєстраційне ім\'я вже використовується. Будь ласка, оберіть якесь інше.',
    52 => 'Надана вами електронна адреса, схоже, не є допустимою.',
    53 => 'Ваш новий пароль прийнято. А тепер, будь ласка, використайте цей новий пароль для входу в систему.',
    54 => 'Ваш запит на новий пароль застарів. Будь ласка, спробуйте ще раз, нижче.',
    55 => 'Вам вислано електронного листа, який ось-ось має прийти. Будь ласка, виконайте вказівки в листі, щоб встановити новий пароль для вашого рахунку.',
    56 => 'Надана електронна адреса вже використовується іншим рахунком.',
    57 => 'Ваш рахунок успішно вилучено.',
    58 => 'Вашу трансляцію успішно збережено.',
    59 => 'Трансляцію успішно вилучено.',
    60 => 'Втулку успішно поновлено',
    61 => 'Втулка %s: Невідоме поле заміщення для повідомлення' 
);

###############################################################################

$LANG_ACCESS = array(
    'access' => 'Доступ',
    'ownerroot' => 'Власник/Root',
    'group' => 'Група',
    'readonly' => 'Лише читання',
    'accessrights' => 'Права доступу',
    'owner' => 'Власник',
    'grantgrouplabel' => 'Надати вищеподаній групі права редагування',
    'permmsg' => 'УВАГА: учасники &mdash; це всі зареєстровані користувачі сайту, а аноніми &mdash; це всі користувачі сайту, що не ввійшли до системи.',
    'securitygroups' => 'Групи безпеки',
    'editrootmsg' => "Хоча ви є адміністратором користувачів, ви не зможете редагувати користувача root, самі не бувши користувачем root. Ви можете редагувати всіх користувачів, окрім користувачів root. Зауважте, що всі спроби незаконно редагувати користувачів root протоколюються. Будь ласка, поверніться на <a href=\"{$_CONF['site_admin_url']}/user.php\">сторінку адміністрування користувачів</a>.",
    'securitygroupsmsg' => 'Відмітьте групи, до котрих бажаєте віднести користувача.',
    'groupeditor' => 'Редактор груп',
    'description' => 'Опис',
    'name' => 'Назва',
    'rights' => 'Права',
    'missingfields' => 'Бракує полів',
    'missingfieldsmsg' => 'Ви повинні надати назву та опис для групи',
    'groupmanager' => 'Менеджер груп',
    'newgroupmsg' => 'Аби виправити чи вилучити групу, клацніть її нижче. Для створення нової групи клацніть &laquo;нова група&raquo; вгорі. Зауважте, що основні групи неможливо вилучити, бо вони використовуються системою.',
    'groupname' => 'Назва групи',
    'coregroup' => 'Основна група', // Core group
    'yes' => 'Так',
    'no' => 'Ні',
    'corerightsdescr' => "Ця група є основною для сайту {$_CONF['site_name']}. Тому її права не можна редагувати. Нижче наведено незмінюваний перелік прав, наданих цій групі.",
    'groupmsg' => 'Групи безпеки на цьому сайті є ієрархічними. Додаючи цю групу до будь-якої з нижчеподаних груп, ви дасте їй всі права тієї групи. Де тільки можливо, вас заохочується використовувати нижчеподані групи для надання групі прав. Якщо ж ви бажаєте окремих прав для своєї групи, то можете обрати права доступу до різних можливостей сайту в розділі &laquo;Права&raquo;, що нижче. Щоб додати цю групу до якоїсь із нижченаведених груп, просто відмітьте поля поряд з бажаними групами.',
	'coregroupmsg' => "Ця група є основною для сайту {$_CONF['site_name']}. Тому групи, до яких вона належить, редагувати не можна. Нижче подано список цих груп (лише для читання).",
    'rightsdescr' => 'Доступ групи до певного з нижчеподаних прав можна прямо надати групі АБО іншій, частиною якої є потрібна нам група. Права, котрі ви бачите без полів для галочки, надаються цій групі, бо вона належить до іншої групи з таким правом. Права, що мають поряд поля для	галочки, можуть прямо надаватись цій групі.',
    'lock' => 'Замкнути',
    'members' => 'Учасники',
    'anonymous' => 'Аноніми',
    'permissions' => 'Дозволи',
    'permissionskey' => 'R = читання, E = редагування, права на редагування включають і права на читання',
    'edit' => 'Редагування',
    'none' => 'Немає',
    'accessdenied' => 'В доступі відмовлено',
    'storydenialmsg' => "Ви не маєте доступу до перегляду цієї статті. Це може бути через те, що ви не є учасником сайту {$_CONF['site_name']}. Будь ласка, <a href=users.php?mode=new>приєднайтесь</a> до {$_CONF['site_name']} для отримання повного учасницького доступу!",
    'eventdenialmsg' => "Ви не маєте доступу до перегляду цієї події. Це може бути через те, що ви не є учасником сайту {$_CONF['site_name']}.  Будь ласка, <a href=users.php?mode=new>приєднайтесь</a> до {$_CONF['site_name']} для отримання повного учасницького доступу!",
    'nogroupsforcoregroup' => 'Ця група не належить до жодної іншої групи',
    'grouphasnorights' => 'Ця група не має доступу до жодної адміністративної функції цього сайту',
    'newgroup' => 'Нова група',
    'adminhome' => 'Домівка адміністратора',
    'save' => 'зберегти',
    'cancel' => 'скасувати',
    'delete' => 'вилучити',
    'canteditroot' => 'Ви намагались редагувати групу Root, не належачи до неї. Тому в доступі до цієї групи вам відмовлено. Якщо ви вважаєте, що це помилка, зверніться до системного адміністратора.',
    'listusers' => 'Перелік користувачів',
    'listthem' => 'перелік',
    'usersingroup' => 'Користувачі в групі "%s"',
    'usergroupadmin' => 'Адміністрування груп користувачів',
    'add' => 'Додати',
    'remove' => 'Усунути',
    'availmembers' => 'Доступні учасники',
    'groupmembers' => 'Члени групи',
    'canteditgroup' => 'Для редагування цієї групи ви повинні бути її членом.  Якщо ви вважаєте, що це помилка, зверніться до системного адміністратора.',
    'cantlistgroup' => 'Щоб бачити членів цієї групи, ви самі повинні бути її членом. Якщо ви вважаєте, що це помилка, зверніться до системного адміністратора.'
);

###############################################################################
# admin/database.php

$LANG_DB_BACKUP = array(
    'last_ten_backups' => 'Останні 10 резервних копій',
    'do_backup' => 'Зробити резервну копію',
    'backup_successful' => 'Резервне копіювання бази даних відбулося успішно.',
    'no_backups' => 'Нема резервних копій у системі',
    'db_explanation' => 'Для створення нової резервної копії системи Geeklog, натисніть кнопку, що нижче',
    'not_found' => "Невірний шлях, або ж утиліта mysqldump не є виконуваною.<br>Перевірте означення <strong>\$_DB_mysqldump_path</strong> в config.php.<br>Наразі змінну означено як: <var>{$_DB_mysqldump_path}</var>",
    'zero_size' => 'Резервне копіювання не вдалося: розмір файлу становив 0 байтів',
    'path_not_found' => "{$_CONF['backup_path']} не існує або не є каталогом",
    'no_access' => "ПОМИЛКА: Каталог {$_CONF['backup_path']} недоступний.",
    'backup_file' => 'Файл резервної копії',
    'size' => 'Розмір',
    'bytes' => 'Байтів',
    'total_number' => 'Загальна кількість резервних копій: %d'
);

###############################################################################

$LANG_BUTTONS = array(
    1 => 'Домівка',
    2 => 'Contact',
    3 => 'Опублікуватись',
    4 => 'Посилання',
    5 => 'Опитування',
    6 => 'Календар',
    7 => 'Статистика сайту',
    8 => 'Personalize',
    9 => 'Шукати',
    10 => 'складний пошук'
);

###############################################################################
# 404.php

$LANG_404 = array(
    1 => 'Помилка 404',
    2 => 'Бачте, ми дивилися всюди, та не змогли відшукати <b>%s</b>.',
    3 => "<p>Просимо пробачення, однак запитаний вами файл не існує. Будь ласка, перевірте <a href=\"{$_CONF['site_url']}\">головну сторінку</a> або <a href=\"{$_CONF['site_url']}/search.php\">сторінку пошуку</a>, щоб побачити, чи знайдеться те, що ви шукаєте."
);

###############################################################################

$LANG_LOGIN = array(
    1 => 'Вимагається реєстрація',
    2 => 'Вибачте, для доступу сюди необхідно зареєструватись як користувач.',
    3 => 'Увійти',
    4 => 'Новий користувач'
);

$LANG_PDF = array(
    1 => 'Функціональність PDF вимкнено',
    2 => 'Наданий документ не відтворено. Документ було прийнято, однак не вдалось обробити. Впевніться, що ви відсилаєте лише документи в форматі HTML, що відповідають стандартові xHTML. Зауважте, що занадто складні документи html можуть відтворитись неправильно, а то й зовсім не відтворитись. Документ, що створився в результаті вашої спроби, мав довжину 0 байтів та був видалений. Якщо ви впевнені, що документ повинен відтворитись без проблем, будь ласка, вишліть його ще раз.',
    3 => 'Невідома помилка при створенні PDF',
    4 => 'Не подано даних про сторінку, або ж ви бажаєте скористатись інструментом ad-hoc для створення PDF, що нижче. Якщо ви вважаєте, що потрапили на цю сторінку помилково, зв\'яжіться з системним адміністратором. В іншому випадку можете скористатись нижчеподаною формою для створення PDF способом ad-hoc.',
    5 => 'Завантажується ваш документ.',
    6 => 'Будь ласка, зачекайте, доки ваш документ завантажиться.',
    7 => 'Для збереження примірника вашого документу можете клацнути правою кнопкою миші на кнопці, що нижче, й вибрати з контекстного меню &laquo;Зберегти посилання...&raquo;',
    8 => 'Поданий у конфігураційному файлі шлях до двійкового файлу HTMLDoc непримустимий, або ця система не може його виконати. Будь ласка, зверніться до системного адміністратора, якщо проблема не зникає.',
    9 => 'Створювач PDF',
    10 => 'Це &mdash; інструмент  Ad-hoc для створення PDF. Він намагається перетворити документ з будь-якого поданого URL в формат PDF. Будь ласка, зауважте, що не кожна сторінка Тенет зможе правильно відтворитись за допомогою цього знаряддя. Це є обмеженням інструменту для створення PDF HTMLDoc, і про такі помилки не слід звітувати адміністраторам цього сайту',
    11 => 'URL',
    12 => 'Створити PDF!',
    13 => 'Налаштування PHP на цьому сервері не дозволяють URL у команді fopen(). Системний адміністратор повинен виправити файл php.ini, встановивши allow_url_fopen в значення On',
    14 => 'Файл PDF, котрий ви запитуєте, або не існує, або ж ви вчинили спробу неправомірного доступу до файлу.'
);

?>
